src/test/oec.API_Automation/prod/JLR_DMS/requests/GetVehicleFile.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soap:Body>
      <getVehicleFile xmlns="http://www.cliffordthames.com/ebusiness/menus/">
         <vehicleFileRequest>
            <dealerDetails manufacturer="JLR" countryCode="GB" languageCode="EN" dealerIdentificationCode="Automation" user="Automation" password="O3Cg0d3l751" vehicleFileID="0"/>
         </vehicleFileRequest>
      </getVehicleFile>
   </soap:Body>
</soap:Envelope>